app/controllers/home_controller.rb

SELECT * FROM `pricelists` ORDER BY pricevalue DESC
---
  def index
    @usstates = Usstate.find(:all)
    @pricelistfrom = Pricelist.find_all_ascending()