app/controllers/listingphotos_controller.rb

SELECT * FROM `listings` WHERE (`listings`.`id` = 19)
SELECT * FROM `listings`
SELECT * FROM `listingphotos` WHERE (`listingphotos`.listing_id = 19)
---
  def homepageflashplayer

    listings = Listing.find(:all)
    @photos = Array.new
    listings.each do |l|

      photos_tmp = l.listingphoto

      photos_tmp.each do |p|